app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
    def index
        if !!current_user
            @articles = Article.all

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "adwi"], ["description", "kjbdbk"], ["created_at", "2020-05-29 20:42:43.637832"], ["updated_at", "2020-05-29 20:42:43.637832"], ["user_id", 1]]
---
    def create
        @article = Article.new(article_params)
        @article.user = User.first
        if @article.save

UPDATE "articles" SET "title" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["title", "updated first article"], ["updated_at", "2020-05-24 16:37:35.780533"], ["id", 1]]
---
    def update
        if @article.update(article_params)