app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
        @user = User.new(params.require(:user).permit(:username, :email, :password))
        if @user.save